GopalSaraf/Practicals/PSDL/include/proc/pic16f18323.inc
// Register: MDCIN2PPS
#define MDCIN2PPS MDCIN2PPS
MDCIN2PPS                                equ 0E1Bh
// bitfield definitions
MDCIN2PPS_MDCIN2PPS_POSN                 equ 0000h
MDCIN2PPS_MDCIN2PPS_POSITION             equ 0000h
MDCIN2PPS_MDCIN2PPS_SIZE                 equ 0005h
MDCIN2PPS_MDCIN2PPS_LENGTH               equ 0005h
MDCIN2PPS_MDCIN2PPS_MASK                 equ 001Fh
MDCIN2PPS_MDCIN2PPS0_POSN                equ 0000h
MDCIN2PPS_MDCIN2PPS0_POSITION            equ 0000h
MDCIN2PPS_MDCIN2PPS0_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS0_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS0_MASK                equ 0001h
MDCIN2PPS_MDCIN2PPS1_POSN                equ 0001h
MDCIN2PPS_MDCIN2PPS1_POSITION            equ 0001h
MDCIN2PPS_MDCIN2PPS1_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS1_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS1_MASK                equ 0002h
MDCIN2PPS_MDCIN2PPS2_POSN                equ 0002h
MDCIN2PPS_MDCIN2PPS2_POSITION            equ 0002h
MDCIN2PPS_MDCIN2PPS2_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS2_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS2_MASK                equ 0004h
MDCIN2PPS_MDCIN2PPS3_POSN                equ 0003h
MDCIN2PPS_MDCIN2PPS3_POSITION            equ 0003h
MDCIN2PPS_MDCIN2PPS3_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS3_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS3_MASK                equ 0008h
MDCIN2PPS_MDCIN2PPS4_POSN                equ 0004h
MDCIN2PPS_MDCIN2PPS4_POSITION            equ 0004h
MDCIN2PPS_MDCIN2PPS4_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS4_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS4_MASK                equ 0010h

// Register: MDMINPPS
#define MDMINPPS MDMINPPS
MDMINPPS                                 equ 0E1Ch
// bitfield definitions
MDMINPPS_MDMINPPS_POSN                   equ 0000h
MDMINPPS_MDMINPPS_POSITION               equ 0000h
MDMINPPS_MDMINPPS_SIZE                   equ 0005h
MDMINPPS_MDMINPPS_LENGTH                 equ 0005h
MDMINPPS_MDMINPPS_MASK                   equ 001Fh
MDMINPPS_MDMINPPS0_POSN                  equ 0000h
MDMINPPS_MDMINPPS0_POSITION              equ 0000h
MDMINPPS_MDMINPPS0_SIZE                  equ 0001h
MDMINPPS_MDMINPPS0_LENGTH                equ 0001h
MDMINPPS_MDMINPPS0_MASK                  equ 0001h
MDMINPPS_MDMINPPS1_POSN                  equ 0001h
MDMINPPS_MDMINPPS1_POSITION              equ 0001h
MDMINPPS_MDMINPPS1_SIZE                  equ 0001h
MDMINPPS_MDMINPPS1_LENGTH                equ 0001h
MDMINPPS_MDMINPPS1_MASK                  equ 0002h
MDMINPPS_MDMINPPS2_POSN                  equ 0002h
MDMINPPS_MDMINPPS2_POSITION              equ 0002h
MDMINPPS_MDMINPPS2_SIZE                  equ 0001h
MDMINPPS_MDMINPPS2_LENGTH                equ 0001h
MDMINPPS_MDMINPPS2_MASK                  equ 0004h
MDMINPPS_MDMINPPS3_POSN                  equ 0003h
MDMINPPS_MDMINPPS3_POSITION              equ 0003h
MDMINPPS_MDMINPPS3_SIZE                  equ 0001h
MDMINPPS_MDMINPPS3_LENGTH                equ 0001h
MDMINPPS_MDMINPPS3_MASK                  equ 0008h
MDMINPPS_MDMINPPS4_POSN                  equ 0004h
MDMINPPS_MDMINPPS4_POSITION              equ 0004h
MDMINPPS_MDMINPPS4_SIZE                  equ 0001h
MDMINPPS_MDMINPPS4_LENGTH                equ 0001h
MDMINPPS_MDMINPPS4_MASK                  equ 0010h

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 0E20h
// bitfield definitions
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0005h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0005h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 001Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 0E21h
// bitfield definitions
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0005h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0005h
SSP1DATPPS_SSP1DATPPS_MASK               equ 001Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 0E22h
// bitfield definitions
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0005h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0005h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 001Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E24h
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0005h
RXPPS_RXPPS_LENGTH                       equ 0005h
RXPPS_RXPPS_MASK                         equ 001Fh
RXPPS_RXPPS0_POSN                        equ 0000h
RXPPS_RXPPS0_POSITION                    equ 0000h
RXPPS_RXPPS0_SIZE                        equ 0001h
RXPPS_RXPPS0_LENGTH                      equ 0001h
RXPPS_RXPPS0_MASK                        equ 0001h
RXPPS_RXPPS1_POSN                        equ 0001h
RXPPS_RXPPS1_POSITION                    equ 0001h
RXPPS_RXPPS1_SIZE                        equ 0001h
RXPPS_RXPPS1_LENGTH                      equ 0001h
RXPPS_RXPPS1_MASK                        equ 0002h
RXPPS_RXPPS2_POSN                        equ 0002h
RXPPS_RXPPS2_POSITION                    equ 0002h
RXPPS_RXPPS2_SIZE                        equ 0001h
RXPPS_RXPPS2_LENGTH                      equ 0001h
RXPPS_RXPPS2_MASK                        equ 0004h
RXPPS_RXPPS3_POSN                        equ 0003h
RXPPS_RXPPS3_POSITION                    equ 0003h
RXPPS_RXPPS3_SIZE                        equ 0001h
RXPPS_RXPPS3_LENGTH                      equ 0001h
RXPPS_RXPPS3_MASK                        equ 0008h
RXPPS_RXPPS4_POSN                        equ 0004h
RXPPS_RXPPS4_POSITION                    equ 0004h
RXPPS_RXPPS4_SIZE                        equ 0001h
RXPPS_RXPPS4_LENGTH                      equ 0001h
RXPPS_RXPPS4_MASK                        equ 0010h

// Register: TXPPS
#define TXPPS TXPPS
TXPPS                                    equ 0E25h
// bitfield definitions
TXPPS_TXPPS_POSN                         equ 0000h
TXPPS_TXPPS_POSITION                     equ 0000h
TXPPS_TXPPS_SIZE                         equ 0005h
TXPPS_TXPPS_LENGTH                       equ 0005h
TXPPS_TXPPS_MASK                         equ 001Fh
TXPPS_TXPPS0_POSN                        equ 0000h
TXPPS_TXPPS0_POSITION                    equ 0000h
TXPPS_TXPPS0_SIZE                        equ 0001h
TXPPS_TXPPS0_LENGTH                      equ 0001h
TXPPS_TXPPS0_MASK                        equ 0001h
TXPPS_TXPPS1_POSN                        equ 0001h
TXPPS_TXPPS1_POSITION                    equ 0001h
TXPPS_TXPPS1_SIZE                        equ 0001h
TXPPS_TXPPS1_LENGTH                      equ 0001h
TXPPS_TXPPS1_MASK                        equ 0002h
TXPPS_TXPPS2_POSN                        equ 0002h
TXPPS_TXPPS2_POSITION                    equ 0002h
TXPPS_TXPPS2_SIZE                        equ 0001h
TXPPS_TXPPS2_LENGTH                      equ 0001h
TXPPS_TXPPS2_MASK                        equ 0004h
TXPPS_TXPPS3_POSN                        equ 0003h
TXPPS_TXPPS3_POSITION                    equ 0003h
TXPPS_TXPPS3_SIZE                        equ 0001h
TXPPS_TXPPS3_LENGTH                      equ 0001h
TXPPS_TXPPS3_MASK                        equ 0008h
TXPPS_TXPPS4_POSN                        equ 0004h
TXPPS_TXPPS4_POSITION                    equ 0004h
TXPPS_TXPPS4_SIZE                        equ 0001h
TXPPS_TXPPS4_LENGTH                      equ 0001h
TXPPS_TXPPS4_MASK                        equ 0010h

